use [BehdarDrugStore]

insert into [user]
([username], [password], [fname], [lname], [ncode], [type], [status]) 
values
	('admin', 'admin', 'admin', 'admin', '1234567891', 0, 1),
	('sysuser', 'sysuser', 'sysuser', 'sysuser', '1234567892', 1, 1),
	('accuser', 'accuser', 'accuser', 'accuser', '1234567893', 2, 1)
;

insert into [dfactory]
([name], [data])
values
	('بوعلی', 'مشهد خیابان وکیل آباد 12341234'),
	('صادقی', 'کرمان میدان آزادی 12545234'),
	('حلال احمر', 'آصفهان خیابان نیک نفس 44341234')
;

insert into [insurance]
([name], [off])
values
	('بنیاد شهید', 100.00),
	('ملی', 70.50),
	('سینا', 23.00)
;

insert into [drug]
([name], [type], [price], [dfactory], [amount])
values
	('کپسول BFD', 'کپسول', 1200, 0, 20),
	('سرماخوردگی بزرگسالان', 'قرص', 1000, 0, 30),
	('کپسول FG', 'کپسول', 1200, 0, 9),
	('کپسول YJ', 'کپسول', 1500, 0, 9),
	('شربت دیفن هیدرامین', 'شربت', 2200, 2, 17),
	('B12', 'آمپول', 700, 2, 5),
	('B6', 'آمپول', 800, 1, 2),
	('LD قرص', 'قرص', 3000, 0, 10),
	('سرنگ 5 سی سی', 'غیره', 200, 1, 60),
	('سرنگ 3.5 سی سی', 'غیره', 200, 1, 60),
	('صابون گلنار', 'آرایشی بهداشتی', 2000, 0, 60),
	('عطر 212', 'آرایشی بهداشتی', 22000, 0, 1),
	('شربت آویشن', 'شربت', 12000, 2, 5),
	('سرم', 'غیره', 10000, 1, 10)
;

--insert into [store]
--([drug], [amount])
--values
--	(0, 20),
--	(1, 30),
--	(2, 9),
--	(3, 9),
--	(4, 17),
--	(5, 5),
--	(6, 2),
--	(7, 10),
--	(8, 60),
--	(9, 60),
--	(10, 60),
--	(11, 1),
--	(12, 5),
--	(13, 10)
--;

insert into [prescription]
([flname], [ncode], [creator], [insurance], [date])
values
	('نادر اسدی', '1234567880', 'admin', 0, '2018-04-13 12:00:00'),
	('سعید قاسم شیرازی', '1244567880', 'sysuser', 1, '2018-04-13 22:00:00'),
	('سعید رئیسی', '1234657880', 'sysuser', 2, '2018-05-13 11:00:00'),
	('سجاد حمزه نژادی', '1234597880', 'sysuser', 1, '2018-04-23 15:00:00'),
	('عباس علی محمدی', '1432567880', 'admin', 0, '2018-04-03 06:00:00')
;

insert into [presdrug]
([prescription], [drug], [amount])
values
	(0, 0, 1),
	(0, 2, 2),
	(0, 4, 1),
	(0, 6, 3),
	(0, 8, 5),
	(0, 10, 2),
	(0, 12, 5),
	(0, 13, 2),
	(1, 1, 1),
	(1, 3, 6),
	(1, 5, 1),
	(1, 7, 1),
	(2, 9, 1),
	(2, 11, 3),
	(2, 0, 1),
	(3, 1, 3),
	(3, 2, 1),
	(3, 3, 6),
	(3, 4, 10),
	(3, 5, 1),
	(4, 6, 2),
	(4, 7, 3),
	(4, 8, 2),
	(4, 9, 2),
	(4, 10, 1)
;
